return {
  "folke/snacks.nvim",
  priority = 1000,
  lazy = false,
  opts = {
    picker = {
      enabled = true,
      jump = {
        jumplist = false,
      },
    },
    bigfile = { enabled = true },
    notifier = { enabled = true },
    quickfile = { enabled = true },
    statuscolumn = { enabled = true },
    words = { enabled = true },
    terminal = { enabled = true },
    git = { enabled = true },
    dashboard = {
      enabled = true,
      header = [[
██╗   ██╗██╗ ██████╗████████╗ ██████╗ ██████╗ ██╗   ██╗██╗
██║   ██║██║██╔════╝╚══██╔══╝██╔═══██╗██╔══██╗╚██╗ ██╔╝██║
██║   ██║██║██║        ██║   ██║   ██║██████╔╝ ╚████╔╝ ██║
╚██╗ ██╔╝██║██║        ██║   ██║   ██║██╔══██╗  ╚██╔╝  ╚═╝
 ╚████╔╝ ██║╚██████╗   ██║   ╚██████╔╝██║  ██║   ██║   ██╗
  ╚═══╝  ╚═╝ ╚═════╝   ╚═╝    ╚═════╝ ╚═╝  ╚═╝   ╚═╝   ╚═╝
]],
      sections = {
        { section = "header" },
        {
            pane = 2,
            section = "terminal",
            cmd = "neofetch --ascii_distro arch",
            height = 10,
            padding = 1,
            ttl = 3600
        },
        { section = "projects", limit = 5, padding = 1 },
        { section = "startup" },
      },
    },
    explorer = {
      enabled = false,
    },
    image = {},
    lazygit = {},
    indent = {},
  },
}
